{
  "projects": [
    {
      "name": "WebRefact",
      "title": "WebRefact",
      "url": "WebRefact",
      "description": "<br> WebRefact is a React web app I built where developers can get feedback on their  personal projects from other developers.",
      "desc": "<p>WebRefact is a React web app I built where developers can get feedback on their  personal projects from other developers. This project is intended to get developers to improve their coding skills and build better personal projects based on the feedback of other developers. </p>",
      "img": "img/webrefact-img.jpg",
      "color": "#76a5af",
      "secondimg": "img/webrefact-img.jpg",
      "info": [
        {
          "title": "Role",
          "content": "Built React app that uses Firebase’s RealTime Database to save users' personal projects. When a user enters their website URL, a screenshot of their live site it taken using thumb.io and displayed to other users to give a preview of the personal project. When a user enters their project's GitHub URL, the languages used on the project are retrieved using the GitHub API."
        },
        {
          "title": "Design Tools",
          "content": "Figma"
        },
        {
          "title": "Development Tools",
          "content": "HTML, CSS, React, Firebase, commentbox.io, thum.io"
        },
        {
          "title": "Date",
          "content": "Dec. 2021 - Current"
        },
        {
          "title": "Links",
          "content": "<a href='https://github.com/1Zapien/WebRefact' target='_blank'>GITHUB </a>  <a href='https://webrefact.netlify.app/home' target='_blank'> LIVE SITE</a>"
        }
      ]
    },
    {
      "name": "ART OF FRAGRANCE",
      "title": "ART OF FRAGRANCE",
      "url": "fragrances",
      "description": "<br> React web app where users can keep track of their fragrance collections and track what fragrances they are using.",
      "desc": "<p>React web app where users can keep track of their fragrance collections and track what fragrances they are using. By using ART OF FRAGRANCE, users can also see what fragrances they are neglecting and/or need to move on from.</p>",
      "img": "img/frag-img.jpg",
      "color": "#7ACCC8",
      "secondimg": "img/frag-img.jpg",
      "info": [
        {
          "title": "Role",
          "content": "Built React app with user accounts and Facebook login authentication in order to allow users to store their own fragrance collections. I added Scent-Of-The-Day (SOTD) functionality so users can keep track of the fragrances used. In the next update, I will add a Weather Checker when users select their SOTDs so they can conveniently consider environmental factors. I will also add a calendar to provide a quick way for each user to view their data."
        },
        {
          "title": "Design Tools",
          "content": "Figma"
        },
        {
          "title": "Development Tools",
          "content": "HTML, CSS, React, Firebase, Facebook Login"
        },
        {
          "title": "Date",
          "content": "March 2022 - Current"
        },
        {
          "title": "Links",
          "content": "<a  href='https://github.com/1Zapien/fragrance-app' target='_blank'> GITHUB </a>  <a href='https://fragrance-app.netlify.app/' target='_blank'> LIVE SITE</a> "
        }
      ]
    },
    {
      "name": "LWCMP",
      "title": "LWCMPT",
      "img": "img/lwcm.jpg",
      "description": "<br>Data collection and visualtion web app.",
      "desc": "<p> The Live Well Community Market Program Tool (LWCMPT) is a web application that helped the Live Well Community Market Program collect data and visualize it using graphs and charts. The Program is from the UC San Diego School Medicine. It aims to promote and improve access to affordable healthy food in San Diego County. The Program works with small neighborhood markets across San Diego to redesign their markets to have easier access to fresher foods. The LWCMPT facilitated the work the Program had to do by placing all of the markets’ data in a web application that can be accessed and changed on any modern phone or computer.</p>",
      "url": "lwcmp",
      "color": "#d2d5de",
      "secondimg": "img/lwcmplan.jpg",
      "info": [
        {
          "title": "Role",
          "content": "Worked with the back-end and front-end development team to implement the login authentication and database structuring. Also worked on user testing and user research."
        },
        {
          "title": "Design Tools",
          "content": "Figma"
        },
        {
          "title": "Development Tools",
          "content": "HTML, CSS, JavaScript, Node.js(Express + Handlebars + Passport)"
        },
        {
          "title": "Date",
          "content": "April 2018 - June 2018"
        },
        {
          "title": "Links",
          "content": "<a href='https://lwcmp.herokuapp.com/' target='_blank'> LIVE SITE</a> "
        }
      ]
    },
    {
      "name": "Research",
      "title": "Research",
      "url": "memory",
      "description": "<br>Vision and Memory Lab at UCSD",
      "desc": "<p> The primary research goal of the Vision and Memory Lab at UCSD is to try to “understand how visual information is represented by the visual system and how it is encoded and integrated into memory.” The project I worked on looked at the effects of proactive interference on object binding to better understand visual short-term memory . The project was built on MATLAB. The entire team worked together to design the objects (shapes) using Psychtoolbox, to write functions to get user input and classify each input based on binding or interference, and finally to design a function to analyze the data.</p>",
      "img": "img/research.png",
      "color": "#6fa0cd",
      "secondimg": "img/researchplan.jpg",
      "info": [
        {
          "title": "Role",
          "content": "Contributed to the development and design of the research project as envisioned by the researcher."
        },
        {
          "title": "Design Tools",
          "content": "Google Docs"
        },
        {
          "title": "Development Tools",
          "content": "MATLAB(Psychophysics Toolbox)"
        },
        {
          "title": "Date",
          "content": "September 2017 - December 2017"
        }
      ]
    }
  ]
}
